starter-kit-mu4e.org
# -*- coding: utf-8 -*-
# -*- find-file-hook: org-babel-execute-buffer -*-

#+TITLE: mu4e Customizations
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args :tangle yes

This is part of the [[file:starter-kit.org][Emacs Starter Kit]].

* Path to installation

This is the path where =mu4e= got installed when I did the installation of =mu= and =mu4e= thru the Debian repository with =maildir-utils=.

#+BEGIN_SRC emacs-lisp :tangle yes
(add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e")
(setq mu4e-mu-binary (executable-find "/usr/bin/mu"))
#+END_SRC

#+RESULTS:
: /usr/bin/mu

Note that if I installed =mu= manually, these are the paths in the =officePC=.

#+BEGIN_SRC emacs-lisp :tangle no
(add-to-list 'load-path "/usr/local/share/emacs/site-lisp/mu4e")
(setq mu4e-mu-binary (executable-find "/usr/local/bin/mu"))
#+END_SRC

* The critical files for using =mu4e=
The following files live in the directory =/usr/share/emacs/site-lisp/mu4e= 

#+BEGIN_SRC emacs-lisp :tangle yes
(require 'mu4e)
(require 'org-mu4e)        ;;store org-mode links to messages
(require 'mu4e-contrib)
#+END_SRC

#+RESULTS:
: mu4e-contrib

* Receiving emails: Setting up the MU mail server

Mostly copied from http://www.djcbsoftware.nl/code/mu/mu4e/Gmail-configuration.html#Gmail-configuration

** COMMENT Get emails with =offlineimap=

#+BEGIN_SRC emacs-lisp :tangle no
(setq mu4e-get-mail-command "offlineimap")   
(setq mu4e-update-mail-and-index 'run-in-background)
#+END_SRC

#+RESULTS:
: offlineimap

Updating email takes ages because I have many Maildir folders, so I follow the advice here: https://www.djcbsoftware.nl/code/mu/mu4e/General.html

DGM disactivates this on 4 august 2019 because I am trying the new method that seems to be quicker, based on =mbsync=.

#+BEGIN_SRC emacs-lisp :tangle no
(setq mu4e-cache-maildir-list t)
#+END_SRC

#+RESULTS:
: t

** New method of getting emails: =mbsync=

Introduced by DGM on 4 august 2019 following https://www.reddit.com/r/emacs/comments/bfsck6/mu4e_for_dummies/

Note that ~Set format=flowed~: 
- mu4e sets up =visual-line-mode= and also fill (=M-q=) to do the right thing. Each paragraph is a single long line; at sending, emacs will add the special line continuation characters.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq mu4e-get-mail-command "mbsync -c ~/.mbsyncrc -a"
  ;; mu4e-html2text-command "w3m -T text/html" ;;using the default mu4e-shr2text
  ;; mu4e-update-interval 300  ; 300/60 = 5 minutes.
  ;; mu4e-headers-auto-update t
  ;; mu4e-compose-signature-auto-include nil
  mu4e-compose-format-flowed t)
#+END_SRC

#+RESULTS:
: t

* Sending emails 
** COMMENT =smtpmail=

#+BEGIN_SRC emacs-lisp :tangle no
(require 'smtpmail)

;;rename files when moving
;;NEEDED FOR MBSYNC
(setq mu4e-change-filenames-when-moving t)

;;set up queue for offline email
;;use mu mkdir  ~/Maildir/personal/queue and ~/Maildir/work/queue to set up first.. but then, how does it choose one? 
(setq smtpmail-queue-mail nil)   ;; start in normal mode
;; (setq smtpmail-queue-mail nil ;; start in normal mode
;;       smtpmail-queue-dir  "~/Maildir/queue/cur") 
#+END_SRC

#+RESULTS:

** Sending email with =msmtp=

- Sending mail with =msmtp= rather than =smtp=, copied from http://zmalltalker.com/linux/mu.html#
- See description of =msmtp= and how to use it with encrypted passwords here: https://wiki.debian.org/msmtp
- More info here: https://marlam.de/msmtp/

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq message-send-mail-function 'message-send-mail-with-sendmail
        sendmail-program "/usr/bin/msmtp")
;; Commented out by DGM on 4 august because I am trying to be able to choose where to send from.
;;        user-full-name "Daniel Guinea"
;;        user-mail-address "daniel.guinea.uned@gmail.com")
#+END_SRC

#+RESULTS:
: /usr/bin/msmtp

*** Don't save message to Sent Messages, Gmail/IMAP takes care of this.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq mu4e-sent-messages-behavior 'delete)
#+END_SRC

#+RESULTS:
: delete

See the documentation for `mu4e-sent-messages-behavior' if you have additional non-Gmail addresses and want assign them different behavior.

*** Don't move to next message when you reach the end of a message.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq mu4e-view-scroll-to-next 'nil)
#+END_SRC

*** Don't keep sent e-mail buffer.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq message-kill-buffer-on-exit t)
#+END_SRC

#+RESULTS:
: t

*** Save attachments in the Downloads folder.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq mu4e-attachment-dir  "~/Downloads")
#+END_SRC

#+RESULTS:
: ~/Downloads

*** Confirmation on every mark execution is too slow to Ambrevar's taste.

#+BEGIN_SRC emacs-lisp :tangle no
(defun ambrevar/mu4e-mark-execute-all-no-confirm ()
  (interactive)
  (mu4e-mark-execute-all t))
(define-key mu4e-headers-mode-map "x" 'ambrevar/mu4e-mark-execute-all-no-confirm)
#+END_SRC

#+RESULTS:
: ambrevar/mu4e-mark-execute-all-no-confirm

*** COMMENT Choose account to send email from

Next is borrowed from http://ionrock.org/emacs-email-and-mu.html (and included in http://zmalltalker.com/linux/mu.html#).  Choose account label to feed =msmtp -a= option based on =From= header in Message buffer; This function must be added to =message-send-mail-hook= for on-the-fly change of =From= address before sending message since =message-send-mail-hook= is processed right  before sending message.

Commented out by DGM on 4 august because I am going to try and use the tips from Linux Magazine.

#+BEGIN_SRC emacs-lisp :tangle no
  (defun choose-msmtp-account ()
    (if (message-mail-p)
        (save-excursion
          (let*
              ((from (save-restriction
                       (message-narrow-to-headers)
                       (message-fetch-field "from")))
               (account
                (cond
                 ((string-match "daniel.guinea.uned@gmail.com" from) "work")
                 ((string-match "daniel.guinea.martin@gmail.com" from) "personal"))))
            (setq message-sendmail-extra-arguments (list '"-a" account))))))
  (setq message-sendmail-envelope-from 'header)
  (add-hook 'message-send-mail-hook 'choose-msmtp-account)
  (add-to-list 'mu4e-bookmarks
               '("maildir:/INBOX OR maildir:/personal/INBOX flag:unread" "Today's news" ?z))
#+END_SRC

#+RESULTS:
| maildir:/INBOX OR maildir:/personal/INBOX flag:unread | Today's news         | 122 |
| flag:unread AND NOT flag:trashed                      | Unread messages      | 117 |
| date:today..now                                       | Today's messages     | 116 |
| date:7d..now                                          | Last 7 days          | 119 |
| mime:image/*                                          | Messages with images | 112 |

*** COMMENT Smartly choose the email address from where to reply

DGM on August 5th: not needed anymore with the =context= setup (I think).

1) messages to =me@foo.example.com= should be replied with =From:me@foo.example.com=
2) messages to =me@bar.example.com= should be replied with =From:me@bar.example.com=
3) all other mail should use =From:me@cuux.example.com=

(I am not sure it is working)

#+BEGIN_SRC emacs-lisp :tangle no
(add-hook 'mu4e-compose-pre-hook
  (defun my-set-from-address ()
    "Set the From address based on the To address of the original."
    (let ((msg mu4e-compose-parent-message)) ;; msg is shorter...
      (when msg
        (setq user-mail-address
          (cond
            ((mu4e-message-contact-field-matches msg :to "daniel.guinea.uned@gmail.com")
              "daniel.guinea.uned@gmail.com")
            ((mu4e-message-contact-field-matches msg :to "daniel.guinea@poli.uned.es")
              "daniel.guinea.uned@gmail.com")
            ((mu4e-message-contact-field-matches msg :to "daniel.guinea.martin@gmail.com")
              "daniel.guinea.martin@gmail.com")
            (t "daniel.guinea.uned@gmail.com")))))))
#+END_SRC

#+RESULTS:
| my-set-from-address |

** Avoid hard wrapping or email content

From https://caolan.org/dotfiles/emacs.html#orgd96aeb0

Many email services/clients expect soft-wrapped emails, so I like to use visual-line-mode and the visual-fill-column package instead of auto-fill-mode. To show whether a paragraph is hard- or soft-wrapped I also turn on visual line indicators in the fringe.

!!here DGM: checking origin of problem

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package visual-fill-column
  :ensure t)
#+END_SRC

** Sending =html= email

=org-mime= can be used to send HTML email using Org-mode HTML export.

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package org-mime
   :ensure t)

;; convert org mode to HTML automatically
(setq org-mu4e-convert-to-html t)
#+END_SRC

#+RESULTS:
: t

** Signature 

Tip from http://www.macs.hw.ac.uk/~rs46/posts/2014-11-16-mu4e-signatures.html for inserting different signatures

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my/mu4e-choose-signature ()
    "Insert one of a number of signatures"
    (interactive)
    (let ((message-signature
            (mu4e-read-option "Signature:"
              '(("formal" .
                (concat
             "Daniel Guinea\n"
             "Dept. Sociología I\nFacultad de CC.PP. y Sociología\nUniversidad Nacional de Educación a Distancia (UNED)\nCalle Obispo Trejo 2, Madrid 28040\nemail: daniel.guinea@poli.uned.es\nTel. +34 91 398 9441"))
                 ("informal" .
                "Daniel\n")))))
      (message-insert-signature)))

;; Now that I am using org mode somehow when composing emails, this keybind is already in use
(add-hook 'mu4e-compose-mode-hook
            (lambda () (local-set-key (kbd "C-c C-w") #'my/mu4e-choose-signature)))
#+END_SRC

#+RESULTS:
| (lambda nil (local-set-key (kbd C-c C-w) #'my/mu4e-choose-signature)) | my-do-compose-stuff | ambrevar/message-github | (lambda nil (set-fill-column 72) (auto-fill-mode 0) (visual-fill-column-mode) (setq visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow)) (visual-line-mode)) | (lambda nil (local-set-key (kbd C-c C-w) #'my-mu4e-choose-signature)) |


Set default signature to nil ("") orginally, now to Daniel

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq mu4e-compose-signature-auto-include nil
        mu4e-compose-signature  "Daniel\n")
#+END_SRC

#+RESULTS:


Set default signature to university's

#+BEGIN_SRC emacs-lisp :tangle no
  (setq mu4e-compose-signature-auto-include nil
        mu4e-compose-signature (concat
                                "Daniel Guinea\n"
                                "Dept. Sociología I\nFacultad de CC.PP. y Sociología\nUniversidad Nacional de Educación a Distancia (UNED)\nCalle Obispo Trejo 2, Madrid 28040\nemail: daniel.guinea@poli.uned.es\nTel. +34 91 398 9441"))
#+END_SRC

#+RESULTS:
: Daniel Guinea
: Dept. Sociología I
: Facultad de CC.PP. y Sociología
: Universidad Nacional de Educación a Distancia (UNED)
: Calle Obispo Trejo 2, Madrid 28040
: email: daniel.guinea@poli.uned.es
: Tel. +34 91 398 9441

* Context feature of =mu4e=
** Configure directories with context 

- Etienne's tip

#+BEGIN_SRC emacs-lisp :tangle yes
(setq mu4e-trash-folder nil ;; must be configured later by context
      mu4e-drafts-folder nil ;; must be configured later by context
      mu4e-sent-folder nil ;; must be configured later by context
      mu4e-compose-reply-to-address nil ;; must be configured later by context
      mu4e-compose-signature nil) ;; must be configured later by context
#+END_SRC

#+RESULTS:

** Archiving

With this code, messages from both personal and work accounts that I want to be archived are savely archived. BUT they disapear from the server, so I better don't use it. I should have an =archive= directory in my gmail account but I have not. 

#+BEGIN_SRC emacs-lisp :tangle yes
(setq mu4e-refile-folder "/archive")       ;; saved messages. Its location is relative to `mu4e-maildir'
#+END_SRC

#+RESULTS:
: /archive

** Setting =mu4e-maildir= 

Notes by https://github.com/djcb/mu/blob/master/mu4e/mu4e-utils.el. The variable  =mu4e-cache-maildir-list= "Whether to cache the list of maildirs; set it to =t= if you find that generating the list on the fly is too slow. If you do, you can set =mu4e-maildir-list= to =nil= to force regenerating the cache the next time =mu4e-get-maildirs= gets called.

#+BEGIN_SRC emacs-lisp :tangle no
(setq mu4e-maildir-list nil)   
#+END_SRC

#+RESULTS:

DGM on 4 august 2019 comments out this code in favour of the next one, following https://www.reddit.com/r/emacs/comments/bfsck6/mu4e_for_dummies/

#+BEGIN_SRC emacs-lisp :tangle yes
(setq mu4e-maildir (expand-file-name "~/Maildir"))
#+END_SRC
