starter-kit-mu4e.el
(add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e")
(setq mu4e-mu-binary (executable-find "/usr/bin/mu"))

(require 'mu4e)
(require 'org-mu4e)        ;;store org-mode links to messages
(require 'mu4e-contrib)

(setq mu4e-get-mail-command "mbsync -c ~/.mbsyncrc -a"
  ;; mu4e-html2text-command "w3m -T text/html" ;;using the default mu4e-shr2text
  ;; mu4e-update-interval 300  ; 300/60 = 5 minutes.
  ;; mu4e-headers-auto-update t
  ;; mu4e-compose-signature-auto-include nil
  mu4e-compose-format-flowed t)

  (setq message-send-mail-function 'message-send-mail-with-sendmail
        sendmail-program "/usr/bin/msmtp")
;; Commented out by DGM on 4 august because I am trying to be able to choose where to send from.
;;        user-full-name "Daniel Guinea"
;;        user-mail-address "daniel.guinea.uned@gmail.com")

(setq mu4e-sent-messages-behavior 'delete)

(setq mu4e-view-scroll-to-next 'nil)

(setq message-kill-buffer-on-exit t)

(setq mu4e-attachment-dir  "~/Downloads")

(use-package visual-fill-column
  :ensure t)

(use-package org-mime
   :ensure t)

;; convert org mode to HTML automatically
(setq org-mu4e-convert-to-html t)

  (defun my/mu4e-choose-signature ()
    "Insert one of a number of signatures"
    (interactive)
    (let ((message-signature
            (mu4e-read-option "Signature:"
              '(("formal" .
                (concat
             "Daniel Guinea\n"
             "Dept. Sociología I\nFacultad de CC.PP. y Sociología\nUniversidad Nacional de Educación a Distancia (UNED)\nCalle Obispo Trejo 2, Madrid 28040\nemail: daniel.guinea@poli.uned.es\nTel. +34 91 398 9441"))
                 ("informal" .
                "Daniel\n")))))
      (message-insert-signature)))

;; Now that I am using org mode somehow when composing emails, this keybind is already in use
(add-hook 'mu4e-compose-mode-hook
            (lambda () (local-set-key (kbd "C-c C-w") #'my/mu4e-choose-signature)))

  (setq mu4e-compose-signature-auto-include nil
        mu4e-compose-signature  "Daniel\n")

(setq mu4e-trash-folder nil ;; must be configured later by context
      mu4e-drafts-folder nil ;; must be configured later by context
      mu4e-sent-folder nil ;; must be configured later by context
      mu4e-compose-reply-to-address nil ;; must be configured later by context
      mu4e-compose-signature nil) ;; must be configured later by context

(setq mu4e-refile-folder "/archive")       ;; saved messages. Its location is relative to `mu4e-maildir'

(setq mu4e-maildir (expand-file-name "~/Maildir"))
