starter-kit-mu4e.org
** Contexts  
- DGM on 4 august has commented all the lines above because we are trying the following from https://www.reddit.com/r/emacs/comments/bfsck6/mu4e_for_dummies/

- NB: on 5 August I comment out all =smtp= references, as I am using =msmtp= to send emails.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq mu4e-contexts
  `( ,(make-mu4e-context 
    :name "work" 
    :enter-func (lambda () (mu4e-message "Entering work context"))
        :leave-func (lambda () (mu4e-message "Leaving work context"))
    ;; we match based on the contact-fields of the message
    :match-func (lambda (msg)
          (when msg
            (mu4e-message-contact-field-matches msg
              :from "daniel.guinea.uned@gmail.com")))
    :vars '( ( user-mail-address . "daniel.guinea.uned@gmail.com")
         ( user-full-name . "Daniel Guinea")
         ( mu4e-compose-signature . 
           (concat 
             "Daniel Guinea\n Dept. Sociología I\nFacultad de CC.PP. y Sociología\nUniversidad Nacional de Educación a Distancia (UNED)\nCalle Obispo Trejo 2, Madrid\nemail: daniel.guinea@poli.uned.es\nTel. +34 91 398 9441\n"))
        (mu4e-compose-format-flowed . t)
        (mu4e-sent-folder . "/work/[work].Sent Mail")
        (mu4e-drafts-folder . "/work/[work].Drafts")
        (mu4e-trash-folder . "/work/[work].Trash")
        (mu4e-maildir-shortcuts . ( ("/work/INBOX"            . ?i)
                                    ("/work/[work].Sent Mail" . ?s)
                                    ("/work/[work].Drafts"    . ?d)
                                    ("/work/[work].Trash"     . ?t)
                                    ("/work/[work].Spam"      . ?b)))))
     ,(make-mu4e-context
    :name "personal"
    :enter-func (lambda () (mu4e-message "Switch to personal context"))
    ;; no :leave-func 
    ;; we match based on the maildir of the message
    ;; this matches maildir /personal and its sub-directories
    :match-func (lambda (msg)
          (when msg
			(string-match-p "^/personal" (mu4e-message-field msg :maildir))))
    :vars '( ( user-mail-address . "daniel.guinea.martin@gmail.com")
        (user-full-name . "Daniel")
        (mu4e-compose-signature .  "Daniel\n")
        (mu4e-sent-folder . "/personal/[personal].Sent Mail")
        (mu4e-drafts-folder . "/personal/[personal].Drafts")
        (mu4e-trash-folder . "/personal/[personal].Trash")
        (mu4e-compose-format-flowed . t)
        (mu4e-maildir-shortcuts . ( ("/personal/INBOX"                . ?i)
                                    ("/personal/[personal].Sent Mail" . ?s)
                                    ("/personal/[personal].Drafts"    . ?d)
                                    ("/personal/[personal].Trash"     . ?t)
                                    ("/personal/[personal].Spam"      . ?b)))))
     ))
#+END_SRC

#+RESULTS:
| #s(mu4e-context work (lambda nil (mu4e-message Entering work context)) (lambda nil (mu4e-message Leaving work context)) (lambda (msg) (when msg (mu4e-message-contact-field-matches msg :from daniel.guinea.uned@gmail.com))) ((user-mail-address . daniel.guinea.uned@gmail.com) (user-full-name . Daniel Guinea) (mu4e-compose-signature concat Daniel Guinea |

Leaving out this: 
#+BEGIN_EXAMPLE
Context 1:
        ;; "/work/[work].All Mail"  . ?a)
        ;; (smtpmail-queue-dir . "~/Maildir/work/queue/cur")
        ;; (message-send-mail-function . smtpmail-send-it)
        ;; (smtpmail-smtp-user . "work")
        ;; (smtpmail-starttls-credentials . (("smtp.gmail.com" 587 nil nil)))
        ;; (smtpmail-auth-credentials . (expand-file-name "~/.authinfo.gpg"))
        ;; (smtpmail-default-smtp-server . "smtp.gmail.com")
        ;; (smtpmail-smtp-server . "smtp.gmail.com")
        ;; (smtpmail-smtp-service . 587)
        ;; (smtpmail-debug-info . t)
        ;; (smtpmail-debug-verbose . t)

Context 2:
        ;; ("/personal/[personal].All Mail"  . ?a)
        ;; (smtpmail-queue-dir . "~/Maildir/personal/queue/cur")
        ;; (message-send-mail-function . smtpmail-send-it)
        ;; (smtpmail-smtp-user . "personal")
        ;; (smtpmail-starttls-credentials . (("smtp.gmail.com" 587 nil nil)))
        ;; (smtpmail-auth-credentials . (expand-file-name "~/.authinfo.gpg"))
        ;; (smtpmail-default-smtp-server . "smtp.gmail.com")
        ;; (smtpmail-smtp-server . "smtp.gmail.com")
        ;; (smtpmail-smtp-service . 587)
        ;; (smtpmail-debug-info . t)
        ;; (smtpmail-debug-verbose . t)
#+END_EXAMPLE

Preferably use context names starting with different letters, because the first letter is automatically used as a short-cut, so you will be able to switch between the two contexts simply using =;w= and =;p=.

*** Context tricks

It is possible to automatically fill =mu4e-user-address-list= by concatenating the user-mail-address fields of all contexts: 

This sets `mu4e-user-mail-address-list' to the concatenation of all `user-mail-address' values for all contexts. If you have other mail addresses as well, you'll need to add those manually.


#+BEGIN_SRC emacs-lisp :tangle yes
  (setq mu4e-user-mail-address-list
    (delq nil
      (mapcar (lambda (context)
		(when (mu4e-context-vars context)
		  (cdr (assq 'user-mail-address (mu4e-context-vars context)))))
	mu4e-contexts)))
#+END_SRC

#+RESULTS:
| daniel.guinea.uned@gmail.com | daniel.guinea.martin@gmail.com |

*** Context costumizationl

#+BEGIN_SRC emacs-lisp :tangle yes
;; Don't bother me with context on startup.
;; (setq mu4e-context-policy nil)

;; alternative from DGM on 4 august 2019, https://www.reddit.com/r/emacs/comments/bfsck6/mu4e_for_dummies/
;; start with the first (default) context;
(setq mu4e-context-policy 'pick-first) 
;; (setq mu4e-context-policy nil) 
;; (setq mu4e-context-policy 'ask-if-none) 
;; whether to compose with the current context if no context matched (nil option. In this case I say "ask always")
;; (setq mu4e-compose-context-policy 'always-ask)
;; (setq mu4e-compose-context-policy 'ask)
(setq mu4e-compose-context-policy nil)

;; (setq mu4e-user-mail-address-list (list "daniel.guinea.uned@gmail.com" "daniel.guinea.martin@gmail.com"))

;; (setq mail-user-agent 'mu4e-user-agent)

;; these are actually the defaults
;;    (setq
;;      ;; mu4e-maildir       "~/Maildir/work"      ;; top-level Maildir
;;      mu4e-sent-folder   "[work].Sent Mail"   ;; folder for sent messages
;;      mu4e-drafts-folder "[work].Drafts"      ;; unfinished messages
;;      mu4e-trash-folder  "[work].Trash")      ;; trashed messages
#+END_SRC

#+RESULTS:
: [work].Trash

Note, =mu4e-maildir= takes an actual =filesystem-path=, the other folder names are all relative to =mu4e-maildir=. Also note that this must not be a symbolic link.

* Attachments
** Gnus for attaching
I don't know the use of this but I had it, so...

#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'gnus-dired)
  ;; make the `gnus-dired-mail-buffers' function also work on
  ;; message-mode derived modes, such as mu4e-compose-mode
  (defun gnus-dired-mail-buffers ()
    "Return a list of active message buffers."
    (let (buffers)
      (save-current-buffer
        (dolist (buffer (buffer-list t))
          (set-buffer buffer)
          (when (and (derived-mode-p 'message-mode)
                     (null message-sent-message-via))
            (push (buffer-name buffer) buffers))))
      (nreverse buffers)))

   (setq gnus-dired-mail-mode 'mu4e-user-agent)
   (add-hook 'dired-mode-hook 'turn-on-gnus-dired-mode)
#+END_SRC

** Saving attachments

#+BEGIN_SRC emacs-lisp :tangle yes
(setq mu4e-attachment-dir "~/Downloads"
      mu4e-save-multiple-attachments-without-asking t)
#+END_SRC

#+RESULTS:
: t


* Customizing the main view
** Adding bookmark to menu or =Main view=
- Read https://www.djcbsoftware.nl/code/mu/mu4e/Bookmarks.html

#+BEGIN_SRC emacs-lisp :tangle yes
(add-to-list 'mu4e-bookmarks
  (make-mu4e-bookmark
    :name  "Messages with attachments"
    :query "flag:attach"
    :key ?a) t)

(add-to-list 'mu4e-bookmarks
  (make-mu4e-bookmark
    :name  "Archived messages"
    :query "maildir:/archive" 
    :key ?r) t)
#+END_SRC

#+RESULTS:
| (flag:unread AND NOT flag:trashed Unread messages 117) | (date:today..now Today's messages 116) | (date:7d..now Last 7 days 119) | (mime:image/* Messages with images 112) | #s(mu4e-bookmark Messages with attachments flag:attach 97) | #s(mu4e-bookmark Archived messages maildir:/archive 114) |

** COMMENT New item in Basics (Main View): =helm-mu=

Not working. 

Tip from https://www.djcbsoftware.nl/code/mu/mu4e/Defining-actions.html
and 
http://djcbsoftware.nl/code/mu/mu4e/Adding-an-action-in-the-message-view.html

#+BEGIN_SRC emacs-lisp :tangle no
(defun my-call-to-helm-mu ()
  "Calls helm-mu."
  (helm-mu)
  )

;; Define 'x' as the shortcut
(add-to-list 'mu4e-view-actions
             '("Mmu search" . my-call-to-helm-mu) t)
#+END_SRC

#+RESULTS:
: ((capture message . mu4e-action-capture-message) (view as pdf . mu4e-action-view-as-pdf) (show this thread . mu4e-action-show-thread) (ViewInBrowser . mu4e-action-view-in-browser) (Mmu search . my-call-to-helm-mu))

