starter-kit-mu4e.el

(setq mu4e-contexts
  `( ,(make-mu4e-context 
    :name "work" 
    :enter-func (lambda () (mu4e-message "Entering work context"))
        :leave-func (lambda () (mu4e-message "Leaving work context"))
    ;; we match based on the contact-fields of the message
    :match-func (lambda (msg)
          (when msg
            (mu4e-message-contact-field-matches msg
              :from "daniel.guinea.uned@gmail.com")))
    :vars '( ( user-mail-address . "daniel.guinea.uned@gmail.com")
         ( user-full-name . "Daniel Guinea")
         ( mu4e-compose-signature . 
           (concat 
             "Daniel Guinea\n Dept. Sociología I\nFacultad de CC.PP. y Sociología\nUniversidad Nacional de Educación a Distancia (UNED)\nCalle Obispo Trejo 2, Madrid\nemail: daniel.guinea@poli.uned.es\nTel. +34 91 398 9441\n"))
        (mu4e-compose-format-flowed . t)
        (mu4e-sent-folder . "/work/[work].Sent Mail")
        (mu4e-drafts-folder . "/work/[work].Drafts")
        (mu4e-trash-folder . "/work/[work].Trash")
        (mu4e-maildir-shortcuts . ( ("/work/INBOX"            . ?i)
                                    ("/work/[work].Sent Mail" . ?s)
                                    ("/work/[work].Drafts"    . ?d)
                                    ("/work/[work].Trash"     . ?t)
                                    ("/work/[work].Spam"      . ?b)))))
     ,(make-mu4e-context
    :name "personal"
    :enter-func (lambda () (mu4e-message "Switch to personal context"))
    ;; no :leave-func 
    ;; we match based on the maildir of the message
    ;; this matches maildir /personal and its sub-directories
    :match-func (lambda (msg)
          (when msg
			(string-match-p "^/personal" (mu4e-message-field msg :maildir))))
    :vars '( ( user-mail-address . "daniel.guinea.martin@gmail.com")
        (user-full-name . "Daniel")
        (mu4e-compose-signature .  "Daniel\n")
        (mu4e-sent-folder . "/personal/[personal].Sent Mail")
        (mu4e-drafts-folder . "/personal/[personal].Drafts")
        (mu4e-trash-folder . "/personal/[personal].Trash")
        (mu4e-compose-format-flowed . t)
        (mu4e-maildir-shortcuts . ( ("/personal/INBOX"                . ?i)
                                    ("/personal/[personal].Sent Mail" . ?s)
                                    ("/personal/[personal].Drafts"    . ?d)
                                    ("/personal/[personal].Trash"     . ?t)
                                    ("/personal/[personal].Spam"      . ?b)))))
     ))

  (setq mu4e-user-mail-address-list
    (delq nil
      (mapcar (lambda (context)
		(when (mu4e-context-vars context)
		  (cdr (assq 'user-mail-address (mu4e-context-vars context)))))
	mu4e-contexts)))

;; Don't bother me with context on startup.
;; (setq mu4e-context-policy nil)

;; alternative from DGM on 4 august 2019, https://www.reddit.com/r/emacs/comments/bfsck6/mu4e_for_dummies/
;; start with the first (default) context;
(setq mu4e-context-policy 'pick-first) 
;; (setq mu4e-context-policy nil) 
;; (setq mu4e-context-policy 'ask-if-none) 
;; whether to compose with the current context if no context matched (nil option. In this case I say "ask always")
;; (setq mu4e-compose-context-policy 'always-ask)
;; (setq mu4e-compose-context-policy 'ask)
(setq mu4e-compose-context-policy nil)

;; (setq mu4e-user-mail-address-list (list "daniel.guinea.uned@gmail.com" "daniel.guinea.martin@gmail.com"))

;; (setq mail-user-agent 'mu4e-user-agent)

;; these are actually the defaults
;;    (setq
;;      ;; mu4e-maildir       "~/Maildir/work"      ;; top-level Maildir
;;      mu4e-sent-folder   "[work].Sent Mail"   ;; folder for sent messages
;;      mu4e-drafts-folder "[work].Drafts"      ;; unfinished messages
;;      mu4e-trash-folder  "[work].Trash")      ;; trashed messages

  (require 'gnus-dired)
  ;; make the `gnus-dired-mail-buffers' function also work on
  ;; message-mode derived modes, such as mu4e-compose-mode
  (defun gnus-dired-mail-buffers ()
    "Return a list of active message buffers."
    (let (buffers)
      (save-current-buffer
        (dolist (buffer (buffer-list t))
          (set-buffer buffer)
          (when (and (derived-mode-p 'message-mode)
                     (null message-sent-message-via))
            (push (buffer-name buffer) buffers))))
      (nreverse buffers)))

   (setq gnus-dired-mail-mode 'mu4e-user-agent)
   (add-hook 'dired-mode-hook 'turn-on-gnus-dired-mode)

(setq mu4e-attachment-dir "~/Downloads"
      mu4e-save-multiple-attachments-without-asking t)

(add-to-list 'mu4e-bookmarks
  (make-mu4e-bookmark
    :name  "Messages with attachments"
    :query "flag:attach"
    :key ?a) t)

(add-to-list 'mu4e-bookmarks
  (make-mu4e-bookmark
    :name  "Archived messages"
    :query "maildir:/archive" 
    :key ?r) t)
