starter-kit-mu4e.org
* Org capture templates, including for emails

Placed here so that they work with emails.

Article from The Reddit Workflow, accessible at https://www.reddit.com/r/emacs/comments/4gudyw/help_me_with_my_orgmode_workflow_for_notetaking/

Read this on email handling: http://pragmaticemacs.com/emacs/master-your-inbox-with-mu4e-and-org-mode/

Templates with shortcuts =u= and =w= taken from =org-drill= manual.

The 'Respond later' template is a customised TODO which includes some extra email information. This relies on the extended email properties made available in the Org-mode -> Custom Links -> mu4e section of this config.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq org-capture-templates `(
                              ("a"  "Article"  entry  
                               (file+headline "/home/dgm/Dropbox/gtd/bibliography.org" "Bibliography") 
                                  "* %a %^g
                                  \n:PROPERTIES: 
                                  \n:Created: %U
                                  \n:END:
                                  \n%i
                                  \nBrief description:
                                  \n%?"  
                                :immediate-finish t 
                                :prepend t  
                                :empty-lines 0 
                                :created t)
                              ("j" "Journal" entry
                                 (file+datetree "/home/dgm/Dropbox/gtd/journal.org")
                                 "* %? \n Added on: %U")
                              ("l" "Life-related Idea" entry
                                (file+headline "~/Dropbox/gtd/notes.org" "Life-related Ideas")
                                 "* %?\nCaptured on %U from %a\n")
                              ("n" "Note" entry
                                (file+headline "~/Dropbox/gtd/notes.org" "Notes")
                                 "* %?\nCaptured on %U from %a\n")
                              ("p" "Project-related Idea" entry
                                (file+headline "~/Dropbox/gtd/notes.org" "Project-related Ideas")
                                 "* %?\nCaptured on %U from %a\n")
                              ("r" "Respond later" entry 
                                (file+headline "~/Dropbox/gtd/inbox.org" "Email")
                                 "* TODO Respond to %a, email by %:from \nEntry added on: %U \n"
                                 :empty-lines 0
                                 :immediate-finish t)
                              ("t" "Todo [inbox]" entry
                                (file+headline "/home/dgm/Dropbox/gtd/inbox.org" "Tasks")
                                 "* TODO %i%? \nEntry added on: %U from %a\n")
                              ("T" "Tickler" entry
                                (file+headline "/home/dgm/Dropbox/gtd/tickler.org" "Tickler")
                                 "* %i%? \nEntry added on: %U from %a\n")
                              ("u" "URLs to remember" entry
                                (file+headline  "/home/dgm/Dropbox/gtd/URLs.org" "URLs")
                                 ,(concat "* TODO Read this URL: '%:description'\nURL: %l\nDate:%U\n\n")
                                 :empty-lines 0
                                 :immediate-finish t)
                              ("w" "Capture web snippet" entry
                                (file+headline "~/Dropbox/gtd/notes.org" "Webs")
                                 ,(concat "* Web: '%:description'\n\nURL: %l\nTime:%U\n\nContents:\n\n %i\n")
                                 :empty-lines 0
                                 :immediate-finish t)))
#+END_SRC

#+RESULTS:
| a | Article | entry | (file+headline /home/dgm/Dropbox/gtd/bibliography.org Bibliography) | * %a %^g |


Original template: 

#+BEGIN_EXAMPLE
(setq org-capture-templates '(
                              ("t" "Todo [inbox]" entry
                               (file+headline "/home/dgm/Dropbox/gtd/inbox.org" "Tasks")
                                 "* TODO %i%? \nEntry added on: %U from %a\n")
                                ("T" "Tickler" entry
                                 (file+headline "/home/dgm/Dropbox/gtd/tickler.org" "Tickler")
                                 "* %i%?
                                      \nEntry added on: %U from %a\n")
                                ("j" "Journal" entry
                                 (file+datetree "/home/dgm/Dropbox/gtd/journal.org")
                                 "* %?
                                      \n Added on: %U")
                                ("n" "Note" entry
                                 (file "~/Dropbox/gtd/notes.org")
                                  "* %?\nCaptured on %U from %a\n")
                                ("a"  "Article"  entry  
                                 (file+headline "/home/dgm/Dropbox/gtd/bibliography.org" "Bibliography") 
                                  "* %a %^g
                                  \n:PROPERTIES: 
                                  \n:Created: %U
                                  \n:END:
                                  \n%i
                                  \nBrief description:
                                  \n%?"  
                                :immediate-finish t 
                                :prepend t  
                                :empty-lines 1  
                                :created t)))
#+END_EXAMPLE

Bits deteled after the Todo "t" capture template: 

#+BEGIN_EXAMPLE
                               ;;               \nEntry created from this heading or email: %a")
                               
#+END_EXAMPLE

From caolan: https://caolan.org/dotfiles/emacs.html#orgd96aeb0
I've disabled it because it was too cumbersome and i've realized that it doesn't not add the origin file from which I capture in the case of emails! 

#+BEGIN_SRC emacs-lisp :tangle no
;; (push `("t" "Todo" entry (file+headline "/home/dgm/Dropbox/gtd/inbox.org" "Tasks")
;;        ,(string-join
;;          '("* TODO %^{Description}"
;;            "  %?"
;;            "  %a"
;;            "  :LOGBOOK:"
;;            "  - Captured on %U from %a"
;;            "  :END:")
;;          "\n"))
;;      org-capture-templates)
#+END_SRC


As Caolan (https://caolan.org/dotfiles/emacs.html#orgd96aeb0) says, during expansion of the template, =%a= has been replaced by a link to the location from where you called the capture command. This can be extremely useful for deriving tasks from emails, for example. This tip from the Org-mode manual. The =%U= will be replaced with the time of the capture, this is an 'inactive' timestamp meaning it won't show up in the agenda view.

Tip from https://lists.gnu.org/archive/html/emacs-orgmode/2007-08/msg00253.html for having agenda show 30 days: =(setq org-agenda-span (quote month))=

** COMMENT org-capture

See: http://pragmaticemacs.com/emacs/master-your-inbox-with-mu4e-and-org-mode/

Originally, before =(setq org-mu4e-link-query-in-headers-mode nil)= I got the following lines but I'm not sure I want to get rid of the =C-c C-t= shortcut.

#+BEGIN_EXAMPLE
    ;; ;; Org mode has "C-c C-t" for 'org-todo.
    ;; (define-key map (kbd "C-c C-t") 'org-mu4e-store-and-capture))
#+END_EXAMPLE

DGM turns it to "off" on 2 august 2019 to try configuration from Linux Magazine

#+BEGIN_SRC emacs-lisp :tangle no
 (when (require 'org-mu4e nil t)
  (dolist (map (list mu4e-view-mode-map mu4e-headers-mode-map)))
  (setq org-mu4e-link-query-in-headers-mode nil))         store link to message if in header view, not to header query
#+END_SRC

#+RESULTS:

* Display 

** Header behaviour

*** Reddit take

From https://www.reddit.com/r/emacs/comments/bfsck6/mu4e_for_dummies/elgoumx via https://www.reddit.com/r/emacs/comments/bfsck6/mu4e_for_dummies/

#+BEGIN_SRC emacs-lisp :tangle yes
(add-hook 'mu4e-headers-mode-hook
      (defun my/mu4e-change-headers ()
	(interactive)
	(setq mu4e-headers-fields
	      `((:human-date . 25) ;; alternatively, use :date
		(:flags . 6)
		(:from . 22)
        (:thread-subject . ,(- (window-body-width) 70)) ;; alternatively, use :subject
		(:size . 7)
        ))))

;; if you use date instead of human-date in the above, use this setting
;; give me ISO(ish) format date-time stamps in the header list
;(setq mu4e-headers-date-format "%Y-%m-%d %H:%M")
#+END_SRC

#+RESULTS:
| my/mu4e-change-headers | (lambda nil (set (make-local-variable 'bookmark-make-record-function) 'mu4e-view-bookmark-make-record)) |

*** Irreal: Toggle per name/full address with =M-RET=. 

https://irreal.org/blog/?p=6122 says:

 These are the headers to show in the headers list -- a pair of a field and its width, with `nil' meaning 'unlimited'.  (Better only use that for the last field.)

These are the defaults:

#+BEGIN_EXAMPLE
(setq mu4e-headers-fields
     '( (:date          .  25)    ;; alternatively, use :human-date
        (:flags         .   6)
        (:from          .  22)
        (:subject       .  nil))) ;; alternatively, use :thread-subject
#+END_EXAMPLE

And from below I have deleted the following because this is all set in the previous heading.

#+BEGIN_EXAMPLE
 mu4e-headers-fields '((:human-date   . 16)
                       (:flags        .  6)
                       (:size         .  6)
                       (:mailing-list . 10)
                       (:from         . 22)
                       (:subject))
#+END_EXAMPLE


#+BEGIN_SRC emacs-lisp :tangle yes
(setq 
 ;; mu4e-headers-date-format "%F %R" ;; already set
 mu4e-headers-time-format "%R"
 mu4e-hide-index-messages t)
#+END_SRC

#+RESULTS:
: t

*** Threading 

Gmail-style threading. 

https://groups.google.com/forum/#!topic/mu-discuss/ZG0trF0reZk say setting it up to "true" causes the "problem" of mu4e not finding emails that =mu= finds.

Also, by turning it off, I don't see the same message multiple times. If I wouldn't set this option here, in headers view I should toggle it with =W=.
#+BEGIN_SRC emacs-lisp :tangle yes
(setq mu4e-headers-include-related 'nil)
;;(setq mu4e-headers-include-related t)
#+END_SRC

#+RESULTS:

** Make some e-mails stand out a bit.

#+BEGIN_SRC emacs-lisp :tangle yes
(set-face-foreground 'mu4e-unread-face "#8b8b00")
(set-face-attribute 'mu4e-flagged-face nil :inherit 'font-lock-warning-face)
#+END_SRC

