starter-kit-mu4e.org
** Viewing images 

Viewing images is not trivial. See  https://groups.google.com/forum/#!topic/mu-discuss/0QIgZ27x3Is and  https://caolan.org/dotfiles/emacs.html#orgd96aeb0.

Finally, I adopted the solution by Caolan, who thinks the included =mu4e-shr2text= command, which uses the =shr= package (also used by =eww=) to render =HTML= too slow and have switched to using =w3m= with the =display_link_number= option.

On 4 august I comment out the line =(setq mu4e-html2text-command "w3m -dump -s -T text/html -o display_link_number=true")= because I think this is cared for in the =init.el=


#+BEGIN_SRC emacs-lisp :tangle yes
(setq mu4e-view-show-images t
      mu4e-show-images t
      mu4e-view-image-max-width 800)

(when (fboundp 'imagemagick-register-types)
    (imagemagick-register-types))

;; (setq mu4e-view-prefer-html t)  ;; trying this off as https://www.djcbsoftware.nl/code/mu/mu4e/Displaying-rich_002dtext-messages.html recommends

;; (setq mu4e-html2text-command "w3m -dump -s -T text/html -o display_link_number=true")
#+END_SRC

#+RESULTS:
: mu4e-shr2text

As I said, now I have the following as suggested by 
[[/media/dgm/blue/documents/elibrary/computing/Linux/linuxFormat/tips/emacs2-email-video-246February2019.pdf]]

And it is fine; it's either that or =mu4e-shr2text= but with the latter I get just the same as I get in EWW if I follow the action of viewing the message in my browser. Then I can open Chromium with =&= and see it as intended. With pandoc I get a wonderfully formatted plain-text message.

#+BEGIN_SRC emacs-lisp :tangle yes
;;(setq mu4e-html2text-command 'mu4e-shr2text)
(setq mu4e-html2text-command "iconv -c -t utf-8 | pandoc -f html -t plain")

;; If I use shr, it is convinient to make =shr/eww= readable with dark themes, i.e., if you're using a dark theme, and the messages are hard to read, it can help to change the luminosity, e.g.:
(setq shr-color-visible-luminance-min 80)
#+END_SRC

#+RESULTS:
: iconv -c -t utf-8 | pandoc -f html -t plain

Alternative from https://etienne.depar.is/emacs.d/mu4e.html that works worse: 

#+BEGIN_SRC emacs-lisp :tangle no
(setq mu4e-html2text-command "w3m -dump -T text/html -cols 72 -o display_link_number=true -o auto_image=false -o display_image=false -o ignore_null_img_alt=true")
#+END_SRC

** Call EWW to display HTML messages by pressing =aV= to view in browser

I still can't see HTML messages okay. Trying this tip from https://irreal.org/blog/?p=6122

#+BEGIN_SRC emacs-lisp :tangle yes
(defun jcs-view-in-eww (msg)
    (eww-browse-url (concat "file://" (mu4e~write-body-to-html msg))))

;; Arrange to view messages in either the default browser or EWW
(add-to-list 'mu4e-view-actions '("ViewInBrowser" . mu4e-action-view-in-browser) t)
(add-to-list 'mu4e-view-actions '("Eww view" . jcs-view-in-eww) t)
#+END_SRC

#+RESULTS:
: ((capture message . mu4e-action-capture-message) (view as pdf . mu4e-action-view-as-pdf) (show this thread . mu4e-action-show-thread) (ViewInBrowser . mu4e-action-view-in-browser) (View in browser . my/mu4e-in-browser) (Eww view . jcs-view-in-eww))

** COMMENT Alternative approach by Etienne for displaying current mail in browser
The following  function is called as a mu4e Action, to display the current email body in your external browser. This is useful when event W3M fails at rendering an HTML soup.
From https://etienne.depar.is/emacs.d/mu4e.html

To use it, when in a message body, press =a= to see this included in list of actions.

Not needed anymore as I have the above code already

#+BEGIN_SRC emacs-lisp :tangle no
(defun my/mu4e-in-browser (msg)
  "View the body of the message in a web browser."
  (interactive)
  (let ((html (mu4e-msg-field (mu4e-message-at-point t) :body-html))
        (tmpfile (format "%s/%d.html" temporary-file-directory (random))))
    (unless html (error "No html part for this message"))
    (with-temp-file tmpfile
      (insert
       "<html>"
       "<head><meta http-equiv=\"content-type\""
       "content=\"text/html;charset=UTF-8\">"
       html))
    (browse-url (concat "file://" tmpfile))))

(add-to-list 'mu4e-view-actions
             '("Etienne-View in browser" . my/mu4e-in-browser) t)
#+END_SRC

#+RESULTS:
: ((capture message . mu4e-action-capture-message) (view as pdf . mu4e-action-view-as-pdf) (show this thread . mu4e-action-show-thread) (ViewInBrowser . mu4e-action-view-in-browser) (View in browser . my/mu4e-in-browser) (Eww view . jcs-view-in-eww) (Etienne-View in browser . my/mu4e-in-browser))

* Miscellanea
** Rename files when moving

https://irreal.org/blog/?p=6122 says it is needed for MBSYNC

 #+BEGIN_SRC emacs-lisp :tangle yes
(setq mu4e-change-filenames-when-moving t)
 #+END_SRC

 #+RESULTS:
 : t

** Completion

Because default completion can be extended (e.g. Helm, Ivy).

#+BEGIN_SRC emacs-lisp :tangle yes
(setq mu4e-completing-read-function 'completing-read)
#+END_SRC

#+RESULTS:
: completing-read

** GPG encryption

Try to automatically decrypt emails.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq mu4e-decryption-policy t)
#+END_SRC

#+RESULTS:
: t

Crypt to self so that we can read sent e-mails.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq  mml-secure-openpgp-encrypt-to-self t)
#+END_SRC

#+RESULTS:
: t

** Playing with =split-view=. 

From https://www.djcbsoftware.nl/code/mu/mu4e/Split-view.html

Don't do any splitting of the frame when opening a message. It will simply occupy the whole window where =mu4= sits.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq mu4e-split-view 'nil)
#+END_SRC

#+RESULTS:

** Direct access to =mu4e=

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key (kbd "C-*") #'mu4e)
#+END_SRC

#+RESULTS:
: mu4e

** COMMENT Spell check: Culprit of not being able to attach to current draft

Also, killing a draft doesn't work properly with this option active.

#+BEGIN_SRC emacs-lisp :tangle no
(add-hook 'mu4e-compose-mode-hook
    (defun my-do-compose-stuff ()
       "My settings for message composition."
       (visual-line-mode)
       (org-mu4e-compose-org-mode)
           (use-hard-newlines -1)
       (flyspell-mode)))
#+END_SRC

** Don't ask when quitting

#+BEGIN_SRC emacs-lisp :tangle yes
(setq mu4e-confirm-quit nil)
#+END_SRC

#+RESULTS:

** Don't reply to self

#+BEGIN_SRC emacs-lisp :tangle yes
(setq mu4e-compose-dont-reply-to-self t)
#+END_SRC

#+RESULTS:
: t

** Org functionality in compose buffer

From https://irreal.org/blog/?p=6122

Turned off as I am getting org-related problems.

#+BEGIN_SRC emacs-lisp :tangle yes
(add-hook 'message-mode-hook 'turn-on-orgtbl)
;; (add-hook 'message-mode-hook 'turn-on-orgstruct++) ;; gives error when composing
#+END_SRC

#+RESULTS:
| turn-on-orgtbl | org-contacts-setup-completion-at-point |

** Preview mail file in a new buffer
This function may be called externally to display an email content when we know its file path.
From: https://etienne.depar.is/emacs.d/mu4e.html

#+BEGIN_SRC emacs-lisp :tangle yes
(defun ed/preview-some-mail-at (path)
  (interactive "fPath: ")
  (call-process
   "mu" nil
   (switch-to-buffer (generate-new-buffer "*mail preview*") t)
   t "view" (expand-file-name path))
  (with-current-buffer "*mail preview*"
    (goto-char (point-min))
    (mu4e~fontify-cited)
    (mu4e~fontify-signature)
    (while (re-search-forward "^\\(\\w+:\\) \\(.*\\)$" nil t)
      (let ((key (match-string 1))
            (value (match-string 2)))
        (beginning-of-line)
        (delete-region (point) (line-end-position))
        (insert (concat (propertize key 'face 'mu4e-header-key-face) " "))
        (if (or (string= key "From:")
                (string= key "To:"))
            (insert (propertize value 'face 'mu4e-special-header-value-face))
          (insert (propertize value 'face 'mu4e-header-value-face)))))
    (forward-line)
    (beginning-of-line)
    (insert "\n")
    (read-only-mode)
    (local-set-key (kbd "q") #'kill-this-buffer)))
#+END_SRC

#+RESULTS:
: ed/preview-some-mail-at

** =helm-mu=

#+BEGIN_SRC emacs-lisp :tangle yes
(use-package helm-mu
  :ensure t)

(when (require 'helm-mu nil t)
  (dolist (map (list mu4e-headers-mode-map mu4e-main-mode-map mu4e-view-mode-map))
    (define-key map "m" 'helm-mu)))
#+END_SRC

#+RESULTS:


** Caolan's costumization <<here>>
!!here: commented out in search of culprit.

From https://caolan.org/dotfiles/emacs.html#orgd96aeb0

#+BEGIN_SRC emacs-lisp :tangle yes
(add-hook 'mu4e-compose-mode-hook
          (lambda ()
            (set-fill-column 72)
            (auto-fill-mode 0)
            (visual-fill-column-mode)
            (setq visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow))
            (visual-line-mode)))


  ;; I want to see full From header, not only name
  (setq mu4e-view-show-addresses t)
#+END_SRC

#+RESULTS:
| my-do-compose-stuff | ambrevar/message-github | (lambda nil (set-fill-column 72) (auto-fill-mode 0) (visual-fill-column-mode) (setq visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow)) (visual-line-mode)) |

Store a link to a mu4e query or message, setting various properties for use in capture templates. Basic support is provided by =org-mu4e=, but this uses some code from Using =org-capture-templates= with =mu4e= to extend the properties available to templates.

I tangle to no because I am going to introduce a modification following the bug reported here: https://github.com/djcb/mu/issues/1381

#+BEGIN_SRC emacs-lisp :tangle yes
(defun org-mu4e-store-link ()
  "Store a link to a mu4e query or message."
  (cond
    ;; storing links to queries
    ((eq major-mode 'mu4e-headers-mode)
     (let* ((query (mu4e-last-query))
             desc link)
       (org-store-link-props :type "mu4e" :query query)
       (setq link (concat "mu4e:query:" query))
       (org-add-link-props :link link :description link)
       link))
    ;; storing links to messages
    ((eq major-mode 'mu4e-view-mode)
     (let* ((msg (mu4e-message-at-point))
            (msgid (or (plist-get msg :message-id) "<none>"))
            (from (car (car (mu4e-message-field msg :from))))
            (to (car (car (mu4e-message-field msg :to))))
            (subject (mu4e-message-field msg :subject))
            link)
       (setq link (concat "mu4e:msgid:" msgid))
       (org-store-link-props
          :type "mu4e" :from from :to to :subject subject
          :message-id msgid)
       (org-add-link-props
          :link link
          :description (funcall org-mu4e-link-desc-func msg))
   link))))

(org-add-link-type "mu4e" 'org-mu4e-open)
(add-hook 'org-store-link-functions 'org-mu4e-store-link)
#+END_SRC

#+results:
| org-mu4e-store-link |

* COMMENT Miscellanea commented out
** COMMENT Every new email composition gets its own frame and screws everything up!

This is what made Composition go bunkers! Adding the scroll bar and loosing connection with external apps!!!

#+BEGIN_SRC emacs-lisp :tangle no
(setq mu4e-compose-in-new-frame t)
#+END_SRC

#+RESULTS:
: t

