starter-kit-mu4e.org
** COMMENT Configure your system for several accounts
Check it out here [[/media/dgm/blue/documents/elibrary/computing/Linux/linuxFormat/tips/emacs2-email-video-246February2019.pdf]]

- First, list your accounts.
- Similar instructions here: https://www.djcbsoftware.nl/code/mu/mu4e/Multiple-accounts.html
- Lo comento porque creo que la seccion Context hace esto. 

#+BEGIN_SRC emacs-lisp :tangle no
(defvar my-mu4e-account-alist
       '(("personal"
            (mu4e-sent-folder "/personal/Sent")
            ;;(mu4e-drafts-folder "/personal/Drafts")
            (user-mail-address "daniel.guinea.martin@gmail.com")
            (smtpmail-default-smtp-server "smtp.gmail.com")
            (smtpmail-local-domain "mail.gmail.com")
            (smtpmail-smtp-user "daniel.guinea.martin")
            (smtpmail-smtp-server "smtp.gmail.com")
            (smtpmail-stream-type starttls)
            (smtpmail-smtp-service 25))
        ("work"
            (mu4e-sent-folder "/work/Sent")
            ;; (mu4e-drafts-folder "/work/Drafts")
            (user-mail-address "daniel.guinea.uned@gmail.com")
            (smtpmail-default-smtp-server "smtp.gmail.com")
            (smtpmail-local-domain "gmail.com")
            (smtpmail-smtp-user "daniel.guinea.uned")
            (smtpmail-smtp-server "smtp.gmail.com")
            (smtpmail-stream-type starttls)
            (smtpmail-smtp-service 587))))
#+END_SRC

- Call the above function by asking which account you want to send email from.

#+BEGIN_SRC emacs-lisp :tangle no
(defun my-mu4e-set-account ()
"Set the account for composing a message."
(let* ((account
     (if mu4e-compose-parent-message
      (let ((maildir (mu4e-message-field mu4e-compose-parent-message :maildir)))
        (string-match "/\\(.*?\\)/" maildir)
        (match-string 1 maildir))
       (completing-read (format "Compose with account: (%s) "
                  (mapconcat #’(lambda (var) (car var))
                      my-mu4e-account-alist "/"))
              (mapcar #’(lambda (var) (car var)) my-mu4e-account-alist)
               nil t nil nil (caar my-mu4e-account-alist))))
       (account-vars (cdr (assoc account my-mu4e-account-alist))))
   (if account-vars
      (mapc #’(lambda (var)
         (set (car var) (cadr var))) account-vars)
   (error "No email account found"))))
#+END_SRC

For this code to run you add a hook for when you want to send an email. This results in Emacs asking you which account to use before you send:

#+BEGIN_SRC emacs-lisp :tangle no
(add-hook ‘mu4e-compose-pre-hook ‘my-mu4e-set-account)
#+END_SRC

** COMMENT Indexing 

From https://github.com/djcb/mu/blob/master/NEWS.org, indexing
(1) Allow for indexing in the background; see =mu4e-index-update-in-background=.
(2) Better handle mbsync output in the update buffer
(3) Add variables =mu4e-index-cleanup= and =mu4e-index-lazy= to enable lazy checking from mu4e; you can sit from mu4e using something like:

DGM sets this to no on 2 march 2019 in an attempt to make things more thorough and read emails in mu4e that I could not originally and that, nonetheless, appeared in =mu=.

#+BEGIN_SRC emacs-lisp :tangle no
(setq
  mu4e-index-cleanup nil      ;; don't do a full cleanup check
  mu4e-index-lazy-check t)    ;; don't consider up-to-date dirs
#+END_SRC

#+RESULTS:
: t

** COMMENT Shortcuts 
Setup some handy shortcuts. You can quickly switch to your Inbox -- press =ji=.  Then, when you want to archive some messages, move them to the 'All Mail' folder by pressing =ma=.

#+BEGIN_SRC emacs-lisp :tangle no
  (setq mu4e-maildir-shortcuts
      '( ("/work/INBOX"                    . ?a)
         ("/work/[work].Sent Mail"         . ?b)
         ("/work/[work].Drafts"            . ?c)
         ("/work/[work].Trash"             . ?d)
         ("/work/[work].Spam"              . ?e)
         ("/personal/INBOX"                . ?f)
         ("/personal/[personal].Sent Mail" . ?g)
         ("/personal/[personal].Drafts"    . ?h)
         ("/personal/[personal].Trash"     . ?i)
         ("/personal/[personal].Spam"      . ?j)
        ))
#+END_SRC

#+RESULTS:
: ((/work/INBOX . 97) (/work/[work].Sent Mail . 98) (/work/[work].Drafts . 99) (/work/[work].Trash . 100) (/work/[work].Spam . 101) (/personal/INBOX . 102) (/personal/[personal].Sent Mail . 103) (/personal/[personal].Drafts . 104) (/personal/[personal].Trash . 105) (/personal/[personal].Spam . 106))

** COMMENT Link behavior

From: https://www.reddit.com/r/emacs/comments/bfsck6/mu4e_for_dummies/

=<tab>= to navigate to links, =<RET>= to open them in browser. =backtab= is not working.

Because I have a plain text file now thanks to Pandoc, this is of no use.

#+BEGIN_SRC emacs-lisp :tangle no
(add-hook 'mu4e-view-mode-hook
  (lambda()
    ;; try to emulate some of the eww key-bindings
    (local-set-key (kbd "<RET>") 'mu4e~view-browse-url-from-binding)
    (local-set-key (kbd "<tab>") 'shr-next-link)
    (local-set-key (kbd "<backtab>") 'shr-previous-link)))
#+END_SRC

#+RESULTS:
| (lambda nil (local-set-key (kbd <RET>) 'mu4e~view-browse-url-from-binding) (local-set-key (kbd <tab>) 'shr-next-link) (local-set-key (kbd <backtab>) 'shr-previous-link)) | auto-fill-mode | (lambda nil (set (make-local-variable 'bookmark-make-record-function) 'mu4e-view-bookmark-make-record)) |

** COMMENT Configuring =mu4e= to work with =org=
- I'm getting org-related errors, so I disable this.
- At any rate, with this disabled I still can use org-capture with =C-c c=
- Following [[/media/dgm/blue/documents/elibrary/computing/Linux/linuxFormat/tips/emacs2-email-video-246February2019.pdf]]

The following sets up the connections in our config: 

#+BEGIN_SRC emacs-lisp :tangle no
(define-key mu4e-headers-mode-map (kbd "C-c c") 'org-mu4e-store-and-capture)
(define-key mu4e-view-mode-map (kbd "C-c c") 'org-mu4e-store-and-capture)
;; store org-mode links to messages
;; store links to message if in header view, not  to header query
(setq org-mu4e-link-query-in-headers-mode nil) 
#+END_SRC

#+RESULTS:

With this, the keys are available in headers-mode and view-mode so you can plan. 

** COMMENT Ambrevar's customization

#+BEGIN_SRC emacs-lisp :tangle no
(defun ambrevar/message-fetch-addresses ()
  "Return a list of (NAME EMAIL) from the message header.
The \"From\", \"To\", \"Cc\" and \"Bcc\" fields are looked up.
Addresses in `mu4e-user-mail-address-list' are filtered out.
Duplicates are removed."
;;  (require 'cl) ;; already in starter-kit.org
  (cl-delete-duplicates
   (seq-remove
    (lambda (contact) (member (cadr contact) mu4e-user-mail-address-list))
    (apply 'append
           (if (eq major-mode 'mu4e-compose-mode)
               (save-restriction
                 (message-narrow-to-headers)
                 (mapcar
                  (lambda (addr) (mail-extract-address-components (message-fetch-field addr) t))
                  (seq-filter 'message-fetch-field
                              '("From" "To" "Cc" "Bcc"))))
             (unless (buffer-live-p (mu4e-get-headers-buffer))
               (mu4e-error "no headers buffer connected"))
             (let ((msg (or (mu4e-message-at-point 'noerror)
                            (with-current-buffer (mu4e-get-headers-buffer)
                              ;; When loading messages, point might
                              ;; not be over a message yet.
                              (mu4e-message-at-point 'noerror)))))
               (when msg
                 (delq nil
                       (mapcar (lambda (field)
                                 ;; `mu4e-message-field' returns a list of (NAME . EMAIL).
                                 (mapcar (lambda (addr) (list (car addr) (cdr addr)))
                                         (mu4e-message-field msg field)))
                               '(:from :to :cc :bcc))))))))))
#+END_SRC

#+RESULTS:
: ambrevar/message-fetch-addresses

*** COMMENT Trash by Ambrevar

Gmail trash fix.

#+BEGIN_SRC emacs-lisp :tangle no
(defvar ambrevar/mu4e-move-to-trash-patterns nil
  "List of regexps to match for moving to trash instead of deleting them.
Matches are done against the :maildir field of the e-mail at
point.  See `ambrevar/mu4e-headers-move-to-trash' and
`ambrevar/mu4e-view-move-to-trash'.")

(defun ambrevar/mu4e-headers-move-to-trash ()
  (interactive)
  (let ((msg-dir (mu4e-message-field (mu4e-message-at-point) :maildir)))
    (if (not (seq-filter (lambda (re)
                           (string-match re msg-dir))
                         ambrevar/mu4e-move-to-trash-patterns))
        (mu4e-headers-mark-for-delete)
      (mu4e-mark-set 'move (funcall mu4e-trash-folder (mu4e-message-at-point)))
      (mu4e-headers-next))))

(defun ambrevar/mu4e-view-move-to-trash ()
  (interactive)
  (mu4e~view-in-headers-context
   (ambrevar/mu4e-headers-move-to-trash)
   (mu4e~headers-move (or n 1))))

;;; Don't display trashed messages in bookmarks.  This is useful for Gmail where
;;; the "delete" flag is not used.
(defvar ambrevar/mu4e-trash-folders nil
  "List of trash folders to filter out from bookmarks.")

;; Do this after setting `ambrevar/mu4e-trash-folders'.
(dolist (bookmark mu4e-bookmarks)
  ;; TODO: Why mu4e-bookmark-query does not work here?
  (setf (car bookmark) (concat  (mapconcat (lambda (s) (format "NOT maildir:\"%s\" and " s))
                                           ambrevar/mu4e-trash-folders "")
                                (car bookmark))))
#+END_SRC

*** COMMENT Github

#+BEGIN_SRC emacs-lisp :tangle no
(defun ambrevar/message-github ()
  "When replying to a github message, clean up all bogus recipients.
This function could be useful in `mu4e-compose-mode-hook'."
  (interactive)
  (let ((to (message-fetch-field "To")))
    (when (and to
               (string-match (rx "@reply.github.com" string-end) (cadr (mail-extract-address-components to))))
      (dolist (hdr '("To" "Cc" "Bcc"))
        (let ((addr (message-fetch-field hdr))
              recipients
              bogus-recipients
              clean-recipients)
          (when (stringp addr)
            (setq recipients (mail-extract-address-components addr t)
                  bogus-recipients (message-bogus-recipient-p addr))
            (when bogus-recipients
              (setq clean-recipients (seq-difference recipients bogus-recipients
                                                     (lambda (addrcomp addr)
                                                       (string= (cadr addrcomp) addr))))
              ;; See `message-simplify-recipients'.
              (message-replace-header
               hdr
               (mapconcat
                (lambda (addrcomp)
                  (if (and message-recipients-without-full-name
                           (string-match
                            (regexp-opt message-recipients-without-full-name)
                            (cadr addrcomp)))
                      (cadr addrcomp)
                    (if (car addrcomp)
                        (message-make-from (car addrcomp) (cadr addrcomp))
                      (cadr addrcomp))))
                clean-recipients
                ", "))))))
      (message-sort-headers)
      ;; Delete signature if any.
      (delete-region (save-excursion
                       (message-goto-signature)
                       (unless (eobp)
                         (forward-line -1))
                       (point))
                     (point-max))
      ;; Deleting trailing blank lines.
      (save-excursion
        (goto-char (point-max))
        (delete-blank-lines)
        (delete-blank-lines)))))
(add-hook 'mu4e-compose-mode-hook 'ambrevar/message-github)
#+END_SRC

#+RESULTS:
| ambrevar/message-github | (lambda nil (local-set-key (kbd C-c C-w) #'my-mu4e-choose-signature)) |

*** Contacts

**** TODO COMMENT Don't duplicate contacts.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun ambrevar/mu4e-contact-dwim ()
    "Return a list of (NAME . ADDRESS).
If point has an `email' property, move it to the front of the list.
Addresses in `mu4e-user-mail-address-list' are skipped."
    (let ((result (ambrevar/message-fetch-addresses))
          (message org-store-link-plist))
      ;; Move contact at point to front.
      (let ((email-at-point (get-text-property (point) 'email))
            (contacts result))
        (when email-at-point
          (while contacts
            (if (not (string= (cadr (car contacts)) email-at-point))
                (setq contacts (cdr contacts))
              (setq result (delete (car contacts) result))
              (push (car contacts) result)
              (setq contacts nil)))))
      result))

  (defun ambrevar/org-contacts-template-name (&optional return-value)
    "Like `org-contacts-template-name' for mu4e."
    (or (car (car (ambrevar/mu4e-contact-dwim)))
        return-value
        "%^{Name}"))
  ;; commented by dgm until i learn how to use contacts with org
  ;; (defun ambrevar/org-contacts-template-email (&optional return-value)
  ;;   "Like `org-contacts-template-name' for mu4e."
  ;;   (or (cadr (car (ambrevar/mu4e-contact-dwim)))
  ;;       return-value
  ;;       (concat "%^{" org-contacts-email-property "}p")))
  ;; (add-to-list 'org-capture-templates
  ;;              `("c" "Add e-mail address to contacts" entry (file+headline ,(car org-contacts-files) "Contacts")
  ;;                "* %(ambrevar/org-contacts-template-name)
  ;; :PROPERTIES:
  ;; :EMAIL: %(ambrevar/org-contacts-template-email)
  ;; :END:")))
#+END_SRC

*** COMMENT Kill-ring

#+BEGIN_SRC emacs-lisp :tangle yes
(defun ambrevar/mu4e-kill-ring-save-message-id (&optional msg)
  "Save MSG's \"message-id\" field to the kill-ring.
If MSG is nil, use message at point."
  (interactive)
  (kill-new (mu4e-message-field (or msg (mu4e-message-at-point)) :message-id)))
#+END_SRC

#+RESULTS:
: ambrevar/mu4e-kill-ring-save-message-id

*** COMMENT mu4e-conversation

De-activated on 4 august by DGM as =mu4e-conversation= was already giving me problems. Plus my new setup with  =mbsync= might be incompatible with this.
 
Check this as well: http://cestlaz.github.io/posts/using-emacs-49-mu4e-conversation/#.W4xUEK0yreQ

#+BEGIN_SRC emacs-lisp :tangle no
(defun ambrevar/mu4e-headers ()
  "Like `mu4e' but show the header view.
Default to unread messages if the header buffer does not already exist."
  (interactive)
  (mu4e~start)
  (if (get-buffer "*mu4e-headers*" )
      (switch-to-buffer "*mu4e-headers*")
    (mu4e-headers-search "flag:unread AND NOT flag:trashed")))

(with-eval-after-load 'mu4e
  ;; mu4e-conversation must be enabled here.
  ;; REVIEW: https://github.com/djcb/mu/issues/1258
  (when (require 'mu4e-conversation nil t)
    (global-mu4e-conversation-mode)
    (add-hook
     'mu4e-conversation-after-send-hook
     (lambda ()
       (let ((mu4e-get-mail-command "offlineimap"))
         (mu4e-update-mail-and-index 'run-in-background))))
    (add-hook 'mu4e-view-mode-hook 'auto-fill-mode)))
(autoload 'ambrevar/mu4e-headers "mu4e")
#+END_SRC
#+RESULTS:

**** make tree view the default
Tip in "mu4e-conversation: Single buffer full-thread display to make e-mails great again" on Reddit.

However, I've realized that if I enable this, my =%a= in the capture template stops working on emails... This happened until ambrevar fixed it after I reported the bug. See [[here]]

#+BEGIN_SRC emacs-lisp :tangle yes
(setq mu4e-conversation-print-function 'mu4e-conversation-print-tree)
#+END_SRC

#+RESULTS:
: mu4e-conversation-print-tree

**** Headers

Don't refresh so that we don't lose the current filter upon, e.g. reading e-mails.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq  mu4e-headers-auto-update nil)
;; (add-hook 'mu4e-index-updated-hook 'mu4e-headers-do-auto-update) ;; updated it says...
#+END_SRC

#+RESULTS:

